Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/include/pio/pic32cx2051mtc128s1.h
#define PIO_PD19C_TC3_TCLK11                       (_UINT32_(1) << 19) /**< TC3 signal: TC3_TCLK11 */
#define PIN_PD0A_TC3_TIOA9                         _UINT32_(96) /**< TC3 signal: TC3_TIOA9 on PD0 mux A */
#define MUX_PD0A_TC3_TIOA9                         _UINT32_(0)  /**< TC3 signal line function value: TC3_TIOA9 */
#define PIO_PD0A_TC3_TIOA9                         (_UINT32_(1) << 0) /**< TC3 signal: TC3_TIOA9 */
#define PIN_PD14A_TC3_TIOA10                       _UINT32_(110) /**< TC3 signal: TC3_TIOA10 on PD14 mux A */
#define MUX_PD14A_TC3_TIOA10                       _UINT32_(0)  /**< TC3 signal line function value: TC3_TIOA10 */
#define PIO_PD14A_TC3_TIOA10                       (_UINT32_(1) << 14) /**< TC3 signal: TC3_TIOA10 */
#define PIN_PD17C_TC3_TIOA11                       _UINT32_(113) /**< TC3 signal: TC3_TIOA11 on PD17 mux C */
#define MUX_PD17C_TC3_TIOA11                       _UINT32_(2)  /**< TC3 signal line function value: TC3_TIOA11 */
#define PIO_PD17C_TC3_TIOA11                       (_UINT32_(1) << 17) /**< TC3 signal: TC3_TIOA11 */
#define PIN_PD4A_TC3_TIOB9                         _UINT32_(100) /**< TC3 signal: TC3_TIOB9 on PD4 mux A */
#define MUX_PD4A_TC3_TIOB9                         _UINT32_(0)  /**< TC3 signal line function value: TC3_TIOB9 */
#define PIO_PD4A_TC3_TIOB9                         (_UINT32_(1) << 4) /**< TC3 signal: TC3_TIOB9 */
#define PIN_PD15A_TC3_TIOB10                       _UINT32_(111) /**< TC3 signal: TC3_TIOB10 on PD15 mux A */
#define MUX_PD15A_TC3_TIOB10                       _UINT32_(0)  /**< TC3 signal line function value: TC3_TIOB10 */
#define PIO_PD15A_TC3_TIOB10                       (_UINT32_(1) << 15) /**< TC3 signal: TC3_TIOB10 */
#define PIN_PD18C_TC3_TIOB11                       _UINT32_(114) /**< TC3 signal: TC3_TIOB11 on PD18 mux C */
#define MUX_PD18C_TC3_TIOB11                       _UINT32_(2)  /**< TC3 signal line function value: TC3_TIOB11 */
#define PIO_PD18C_TC3_TIOB11                       (_UINT32_(1) << 18) /**< TC3 signal: TC3_TIOB11 */
/* ========== PIO definition for UART peripheral ========== */
#define PIN_PD1A_UART_URXD                         _UINT32_(97) /**< UART signal: UART_URXD on PD1 mux A */
#define MUX_PD1A_UART_URXD                         _UINT32_(0)  /**< UART signal line function value: UART_URXD */
#define PIO_PD1A_UART_URXD                         (_UINT32_(1) << 1) /**< UART signal: UART_URXD */
#define PIN_PD12A_UART_URXD                        _UINT32_(108) /**< UART signal: UART_URXD on PD12 mux A */
#define MUX_PD12A_UART_URXD                        _UINT32_(0)  /**< UART signal line function value: UART_URXD */
#define PIO_PD12A_UART_URXD                        (_UINT32_(1) << 12) /**< UART signal: UART_URXD */
#define PIN_PD2A_UART_UTXD                         _UINT32_(98) /**< UART signal: UART_UTXD on PD2 mux A */
#define MUX_PD2A_UART_UTXD                         _UINT32_(0)  /**< UART signal line function value: UART_UTXD */
#define PIO_PD2A_UART_UTXD                         (_UINT32_(1) << 2) /**< UART signal: UART_UTXD */
#define PIN_PD13A_UART_UTXD                        _UINT32_(109) /**< UART signal: UART_UTXD on PD13 mux A */
#define MUX_PD13A_UART_UTXD                        _UINT32_(0)  /**< UART signal line function value: UART_UTXD */
#define PIO_PD13A_UART_UTXD                        (_UINT32_(1) << 13) /**< UART signal: UART_UTXD */
/* ========== PIO definition for TPI peripheral ========== */
#define PIN_PB10D_TPI_TRACESWO0                    _UINT32_(42) /**< TPI signal: TPI_TRACESWO0 on PB10 mux D */
#define MUX_PB10D_TPI_TRACESWO0                    _UINT32_(3)  /**< TPI signal line function value: TPI_TRACESWO0 */
#define PIO_PB10D_TPI_TRACESWO0                    (_UINT32_(1) << 10) /**< TPI signal: TPI_TRACESWO0 */

#endif /* _PIC32CX2051MTC128S1_GPIO_H_ */

